org-docs/dsa-java-notes/note2.org
#+TITLE: First java program input/output debugging and datatypes
* structure of a java file
** Name: every file that ends with an extensions .java is a class itself; eg: main.java
*** since it's name is main.java(or some name before ___.java) it should contain a class with that name (as in before the extension) in the file itself
*** all the code that we'll be writing will be in this class main/name
** the Class in the name: remember if a variable name starts with a capital letter then it is a class name (by convention)
*** if the class with the name of the file is in the file then that will be a class of the public type , in this case main is the public class type
*** public class means that this class will be accessible by all other files , classes, etc
*** like cpp , java also has a main function (by convention) from where the program starts , whenever we run the program the compiler will look for main , if it is not present then the compiler will throw error
** function is a block/collection of code which can be used again and again
** you can run with the java compiler "javac" _name_.java and then java _name_ (where name is the class as well as the file name) , also while running the executable(class file) with java you can use the class name only

* explanation of the main.java file

#+begin_src java
public class main { // inside this block of {} is the int main of java as found in cpp
    public static void main(String[] args) {
        System.out.println("hello world!!");
    }
}
#+end_src

** here class is name group of properties and functions , in the above eg's class we have this function
#+begin_src java
public static void main(String[] args) {
    System.out.println("hello world!!");
}
#+end_src
** all the functions that are in the classes are knows as methods
*** also the function name has to be main only like here " public static void main(String[] args) " it is reserved to be here if it is not main it will not run since main function is the entry point of the function
** here public means the same as in the class name part " public static void main(String[] args) " since main is necessary to run the program so it makes sense to make it available to be executed from anywhere i.e public class type , if we make it private then it will not be available like the public class and hence it will not be valid
** here static means: this main function/method is a part of the _Main_ class also main is required to be run without creating an object of this Main class ,so we use the static type . Since nothing is running before the main() function then there is no use of making an object there
*** so static variables and functions are the variables and functions that don't depend on the object
** void is the return type of the function, since we don't want any value here so we have used void(like in cpp)
** (String[] args) are the arguments , collection of strings
*** here args is the arguments given in the terminal with java command (like java Main 50 100 ...) after compiling with the javac(like javac Main(class/file name)) and the no inside the [] is the index of the array to which the values given with the java command will be printed , the values given with the java command is stored in the String[] array
** if you use javac -d _directory_ _name_: this -d flag is used to give a directory to store the .class file
** package is the folder where the java file will lie, eg package com.kunal , this com.kunal is a subfolder in the com folder (you can make more of those subfolders) , '.' period means subfolder
** then comes = System.out.println("hello world!!"); = this prints a string , if we use ctrl/cmd+click on this we get

#+begin_src java
/**
 ,* Prints a String and then terminate the line.  This method behaves as
 ,* though it invokes {@link #print(String)} and then
 ,* {@link #println()}.
 ,*
 ,* @param x  The {@code String} to be printed.
 ,*/
public void println(String x) {
    if (getClass() == PrintStream.class) {
        writeln(String.valueOf(x));
    } else {
        synchronized (this) {
            print(x);
            newLine();
        }
    }
}
#+end_src

*** to print stuff we have the _System_ class , it is in file called System.java(since System starts with a capital letter hence we know it is a class) in the java.lang package. All the stuff available in the lang package can be accessed in the files created by the people who made java
*** _println_ in the above src says that you will give a string and it'll print that string
*** _out_ is a variable contained in the System class, it is basically a type of PrintStream(will be expained later), and PrintStream has something called println. out is like a reference variable for PrintStream and by default value of the standard output stream i.e the out is the commandline i.e laptop (idk what that means) or the place where the output will be shown, out's original value is null (like this here) = public static final PrintStream out = null; which means that the output will be in the commandline but if we declare out = _some file or anything_ then it will take the output of that println into that file or something
*** ## so it means System has a variable called out which is of type PrintStream and this out has a method/function called println, since out is of type PrintStream so println is also in PrintStream : in the standard output stream print something

**  *NOTE* some of the reference  which can be added to the code itself instead of here are done in the file mentioned here

*** for input in Main.java the code: ~ Scanner input = new Scanner(System.in); ~  Scanner is a public class (it allows us to take input in simple sense) which is a simplet text scanner which can parse primitive types and strings using regular expressions, then the input is a variable and by using Scanner , this input will read everything we want ,then we add a new object i.e 'new' which is a keyword then Scanner(), in the brackets here we need to pass from where we will pass the input (can be a file or keyboard) (the standard input System.in refers to the keyboard input) also the default value of System.in is null we can also define it to be something else . object is a type of scanner and it has a value of System.in whenever input asks for something you will take the value from the keyboard this is the meaning ; again scanner is basically a class that specifies an input stream and using the variable (object) of the class we can take input
**** regarding the new keyword , it is used to

*** every class in java extends the object class , eg: Scanner ; important concept

#+begin_src java
System.out.println(input.nextInt()); //whatever input we got , it is passed into the print statement
System.out.println(input.next()); //whatever input we got , it is passed into the print statement
System.out.println(input.nextln()); //whatever input we got , it is passed into the print statement
#+end_src

***** nextInt prints the integer output
***** next prints the first string(/word) of a sentence of the input in the output
***** nextln prints the whole string of a sentence of the input in the output

**** input is a variable pointing to the object of scannner class so it'll contain all the functions provided by the scanner class ; whatever input will be given it will be shown in output

* Datatypes
*** Primitive data types are the ones which cannot be further broken into other datatypes . eg: "Kunal" this word can be further divided into individual letters i.e the string can be divided into char , but the char cannot be further divided into other data types, this last datatype which cannot be divided into further data type is known as primitive
*** To know why we are adding f to float and L to long at their respective end of the data type declaration value , we need to know the size of the bitwise operators ( also the range of them will be in the bitwise operators )
**** for now the size are : int and float has 4 bytes, double and long has 8 bytes
*** All the decimal values are of the type double by default so if there is a need to store them in float then we need to add an 'f' (remember lower case f only) after the end of the value
**** as to why use double instead of float: float gives errors sometimes floating point error so to get more accurate value we use double
**** also we can  store larger decimal values using the double type
*** And the by default declaration type of integer values is "int" so we use 'L' (remember upper case L only) at the end of the long type
**** why use long instead of int: it can store more/long integer values

*** There contains a class for every data type known as wrapper classes for giving additional funtionality to the primitive datatypes, and they are written as
#+begin_src java
Integer rollno = 8;
String name = "tera baap hu";
#+end_src
**** as you can see it contains the capital first letter which by convention means classes so all the other datatypes are written like the above example ( more on that later on OOPs )
